<template>
  <div class="single">
    <div class="single-desc">
      <div class="single-top">
        <h4>В очікуванні варварів</h4>

        <div class="single-top-back">
          <button>
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24">
              <path class="a" d="M0,0H24V24H0Z"/>
              <path class="b" d="M20,11H7.83l5.59-5.59L12,4,4,12l8,8,1.41-1.41L7.83,13H20Z"/>
            </svg>
          </button>
          <h4>Повернутись назад</h4>
        </div>

      </div>
      <div class="single-content">
        <div style="background-image:url('/movies/1-full.png')" class="single-image">

        </div>

        <div class="single-about">
          <ul class="single-about-list">
            <li class="single-about-list-item">
              <span class="single-about-list-title">
                <span>Вікові обмеження</span>
              </span>
              <span class="single-about-list-desc">16+</span>
            </li>
            <li class="single-about-list-item">
              <span class="single-about-list-title">
                <span>Оригінальна назва</span>
              </span>
              <span class="single-about-list-desc">waiting_for_the_barbarians</span>
            </li>
            <li class="single-about-list-item">
              <span class="single-about-list-title">
                <span>Країна</span>
              </span>
              <span class="single-about-list-desc">США, Італія</span>
            </li>
            <li class="single-about-list-item">
              <span class="single-about-list-title">
                <span>Мова</span>
              </span>
              <span class="single-about-list-desc">Українська</span>
            </li>
            <li class="single-about-list-item">
              <span class="single-about-list-title">
                <span>У головних ролях</span>
              </span>
              <span class="single-about-list-desc">Марк Райленс, Джонні Депп, Роберт Паттінсон</span>
            </li>
            <li class="single-about-list-item">
              <span class="single-about-list-title">
                <span>Режисер</span>
              </span>
              <span class="single-about-list-desc">Сіро Ґерра</span>
            </li>
            <li class="single-about-list-item">
              <span class="single-about-list-title">
                <span>Тривалість</span>
              </span>
              <span class="single-about-list-desc">1:53 / 113 хв</span>
            </li>
          </ul>

          <div class="single-about-film">
            <h4 class="single-header">Опис фільму</h4>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>    <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.</p>
            <p>Невеличке місто на околиці могутньої і деспотичної Імперії розбурхане повідомленням про можливий напад
              племен із сусідніх пустель, яких імперці називають варварами. Полковник Джолл, який щойно прибув зі
              столиці, готовий на будь-що аби вибити з людини необхідні покази. Жорстокість полковника штовхає міського
              суддю, людину від природи тиху й делікатну, на бунт проти Імперії.last</p>
          </div>

        </div>

      </div>
    </div>
    <div class="single-schedule">
      <div class="single-schedule-top">
        <h2>Розклад сеансів</h2>
        <p class="accent">8 Сеансів</p>
        <p>Київ, ТРЦ Аладдин</p>


        <dropdown-menu
          v-model="movieDates"
          :right="right"
          :hover="hover"
          :interactive="interactive"
          transition="translate-fade-down"
        >
          <div class="btn btn-primary dropdown-toggle">
            <button class="app-header-button">
              <svg class="header-meta__icon" xmlns="http://www.w3.org/2000/svg" width="24" height="24"
                   viewBox="0 0 24 24">
                <path class="a" d="M0,0H24V24H0Z"/>
                <path class="b"
                      d="M-4519-2387a2.006,2.006,0,0,1-2-2v-16a2.005,2.005,0,0,1,2-2h1v-2h2v2h4v-2h2v2h4v-2h2v2h1a2,2,0,0,1,2,2v16a2.005,2.005,0,0,1-2,2Zm0-2h16v-16h-1v1.983h-2V-2405h-4v2h-2v-2h-4v1.983h-2V-2405h-1Z"
                      transform="translate(4523 2410)"/>
                <path class="b"
                      d="M-4.741-5.405h.878q1.044,0,1.044-.989a.84.84,0,0,0-.249-.628.961.961,0,0,0-.7-.243,1.031,1.031,0,0,0-.643.208.629.629,0,0,0-.273.518H-6.547a1.8,1.8,0,0,1,.354-1.1,2.323,2.323,0,0,1,.98-.751,3.449,3.449,0,0,1,1.378-.27,3.372,3.372,0,0,1,2.11.593,1.947,1.947,0,0,1,.768,1.63,1.607,1.607,0,0,1-.318.949,2.25,2.25,0,0,1-.925.724,2.163,2.163,0,0,1,1.005.681A1.755,1.755,0,0,1-.83-2.947,1.985,1.985,0,0,1-1.658-1.28a3.52,3.52,0,0,1-2.176.625A3.67,3.67,0,0,1-5.3-.946a2.283,2.283,0,0,1-1.025-.807,2.048,2.048,0,0,1-.348-1.173H-4.8a.8.8,0,0,0,.3.62,1.074,1.074,0,0,0,.735.262,1.126,1.126,0,0,0,.784-.265.87.87,0,0,0,.293-.676A1.015,1.015,0,0,0-3-3.818a1.3,1.3,0,0,0-.84-.246h-.906ZM3.326-.761H1.459V-6.394l-1.834.518V-7.361l3.53-1.181h.171Z"
                      transform="translate(13.674 18.654)"/>
              </svg>
            </button>
            <h4 class="dropdown__header">Сьогодні, 17 серпня</h4>
            <button>
              <div class="expand-arrow">
                <svg id="baseline-expand_more-24px" xmlns="http://www.w3.org/2000/svg" width="24" height="24"
                     viewBox="0 0 24 24">
                  <path id="Контур_2002" data-name="Контур 2002" d="M16.59,8.59,12,13.17,7.41,8.59,6,10l6,6,6-6Z"
                        fill="#000067"/>
                  <path id="Контур_2003" data-name="Контур 2003" d="M0,0H24V24H0Z" fill="none"/>
                </svg>
              </div>
            </button>
          </div>
          <div slot="dropdown">
            <div class="dropdown-menu-list">
              <div class="dropdown-item">
                <a class="dropdown-link" href="#">Action</a>
              </div>
              <div class="dropdown-item">
                <a class="dropdown-link" href="#">Action</a>
              </div>
              <div class="dropdown-item">
                <a class="dropdown-link" href="#">Action</a>
              </div>

            </div>
          </div>
        </dropdown-menu>
      </div>
      <div class="single-schedule-content">

        <ul class="schedule-proposals single-prop">
          <li v-for="item in 6" class="schedule-proposals__item">
            <a class="schedule-proposals__link" href="#">
              <h4 class="schedule-proposals__time">11:50</h4>
              <!-- <h5 class="schedule-proposals__type">2D</h5> -->
              <div class="schedule-dates">
                <div class="schedule-proposals__action schedule-proposals__action--default">
                  <img src="/icons/good.svg" alt/>
                  <h4>
                    80
                    <small>грн</small>
                  </h4>
                </div>
                <div class="schedule-proposals__action schedule-proposals__action--luxt">
                  <img src="/icons/lux.svg" alt/>
                  <h4>
                    110
                    <small>грн</small>
                  </h4>
                </div>
              </div>
            </a>
          </li>
          <li class="schedule-proposals__item">
            <a class="schedule-proposals__link" href="#">

              <div class="schedule-proposals__3d">
                <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16">
                  <path class="a" d="M0,0H16V16H0Z"/>
                  <path class="b"
                        d="M651.284,450.215c-.22-.233-2.459-2.44-3.112-3.1s-1.053-.286-1.153-.226l-1.619.931a.663.663,0,0,0,.34,1.243c.26.047,1.366-.685,1.48-.751s.133-.106.313.04,1.26,1.257,1.26,1.257a.269.269,0,0,1-.013.372.281.281,0,0,1-.173.067h-8.89a.285.285,0,0,1-.18-.067.268.268,0,0,1-.007-.372s1.08-1.11,1.26-1.257.2-.106.313-.04,1.213.8,1.479.751a.666.666,0,0,0,.34-1.243l-1.619-.931c-.107-.06-.5-.425-1.153.226s-2.9,2.865-3.112,3.1a.6.6,0,0,0-.207.5l.666,4.661a.664.664,0,0,0,.626.665l3.979.007a.354.354,0,0,0,.167-.08c.413-.425,1.479-1.489,1.893-1.895l1.893,1.888a.247.247,0,0,0,.16.08H650.2a.669.669,0,0,0,.626-.665l.666-4.661A.643.643,0,0,0,651.284,450.215Zm-1.753,4.288a.263.263,0,0,1-.253.206h-2.786a.246.246,0,0,1-.18-.073l-1.759-1.755a.556.556,0,0,0-.393-.166.534.534,0,0,0-.393.166l-1.759,1.755a.27.27,0,0,1-.18.073h-2.786a.252.252,0,0,1-.253-.206l-.566-2.812a.253.253,0,0,1,.207-.3c.007-.013,2.872-.013,5.731-.013s5.725,0,5.731.013a.267.267,0,0,1,.207.3Z"
                        transform="translate(-636.158 -443.389)"/>
                </svg>
              </div>

              <h4 class="schedule-proposals__time">11:50</h4>
              <!-- <h5 class="schedule-proposals__type">2D</h5> -->
              <div class="schedule-dates">
                <div class="schedule-proposals__action schedule-proposals__action--default">
                  <img src="/icons/good.svg" alt/>
                  <h4>
                    80
                    <small>грн</small>
                  </h4>
                </div>
                <div class="schedule-proposals__action schedule-proposals__action--luxt">
                  <img src="/icons/lux.svg" alt/>
                  <h4>
                    110
                    <small>грн</small>
                  </h4>
                </div>
              </div>
            </a>
          </li>
        </ul>
      </div>
    </div>

  </div>
</template>

<script>

import DropdownMenu from "@/components/DropdownMenu";

export default {
  name: "index",
  data: () => ({
    movieDates: false,
    right: false,
    hover: false,
    interactive: false,
  }),
  beforeMount() {

  },
  components: {
    DropdownMenu,
  }
}
</script>
